# ArrayLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..ArrayLength Property
RebarInSystem Class See Also
---
Identifies the distribution path length of rebar set.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ArrayLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ArrayLength As Double
	Get
```

Visual C++
---
```text
public:
property double ArrayLength {
	double get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | This rebar element represents a single bar (the layout rule is Single). |

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace